index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-29 Sun 20:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to Coxeter Groups</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Doe" />
<link href="css/tufte.min.css" rel="stylesheet" type="text/css" />
</head>
<body>
<article id="">
<h1 class="title">Introduction to Coxeter Groups</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org67d7ce2">1. Motivation</a></li>
<li><a href="#org1077461">2. The integral networked-numbers game</a></li>
<li><a href="#orgdb25e87">3. Exercises</a></li>
</ul>
</div>
</div>

<section id="outline-container-org67d7ce2" class="outline-2">
<h2 id="org67d7ce2"><span class="section-number-2">1</span> Motivation</h2>
<p>
We introduce a class of groups named for HSM Coxeter which generalize involutions in \(\mathbb R^n\). The actions of Coxeter groups arise in the study of <i>networked-numbers games</i>, the first of which appeared in the International Mathematics Olympiad in 1986 ((CITE)):
</p>

<p>
<i>To each vertex of a regular pentagon an integer is assigned, so that the sum of all five numbers is positive. If three consecutive vertices are assigned the numbers \(x\), \(y\), \(z\) respectively, and \(y\) &lt; 0, then the following operation is allowed: \(x, y, z\) are replaced by \(x + y, -y, z + y\) respectively. Such an operation is performed repeatedly as long as at least one of the five numbers is negative. Determine whether this procedure necessarily comes to an end after a finite number of steps.</i>
</p>

<p>
This game is implemented below.
</p>

<figure id="pentagonal-ing"></figure>
<script src="js/vis-network.min.js"></script>
<script src="js/numbers-game.js"></script>
<script type="text/javascript">
    var container = document.getElementById('pentagonal-ing');
    var network = cyclicNumbersGame(5, [-1, -2, -3, 4, 5], container);
</script>

<p>
Observe that the operation described in the problem statement, which we shall call <i>firing a vertex</i>, leaves the sum of all vertex labels unchanged. Therefore, if this sum is initially negative, the procedure never terminates.
</p>

<p>
If we disregard the legality of firings, we may observe the following:
</p>
<ol class="org-ol">
<li>Firing the same vertex twice leaves the vertex labels unchanged.</li>
<li>If \(x\) and \(y\) are adjacent vertices, firing \(x\), \(y\), \(x\) gives the same result as firing \(y, x, y\).</li>
<li>If \(x\) and \(z\) are nonadjacent vertices, firing \(x, z\) gives the same result as firing \(z, x\).</li>
</ol>

<p>
It turns out that we may encode these properties nicely into presentations by generators and relations of certain groups &#x2013; examples of the <i>Coxeter groups.</i> The game is then described by the action of this group on the set \(\mathbb Z^n.\)
</p>
</section>

<section id="outline-container-org1077461" class="outline-2">
<h2 id="org1077461"><span class="section-number-2">2</span> The integral networked-numbers game</h2>
<p>
<b>Definition.</b> Let \(G = (V, E)\) be a finite directed acyclic graph, and let \(\mathbf A \in M_{|V|}(\mathbb Z)\) be a matrix such that \(\mathbf A_{xy} \not = 0\) if \(x = y\) or if \(x\) precedes \(y\) in \(G\). Then \(\mathbf A\) is called an <i>amplitude matrix</i> for \(G\).
</p>

<p>
<b>Example.</b> For any
</p>
</section>

<section id="outline-container-orgdb25e87" class="outline-2">
<h2 id="orgdb25e87"><span class="section-number-2">3</span> Exercises</h2>
<ol class="org-ol">
<li>Prove the assertions made concerning vertex firings in the introduction.</li>
</ol>
</section>
</article>
<footer id="" class="status">
<p class="author">Author: John Doe</p>
<p class="date">Created: 2020-11-29 Sun 20:09</p>
</footer>
</body>
</html>
